[
        {
                "id": "training-R24BCMAD01",
                "title": "[R24BCMAD01] Red Team Operations",
                "people": "Eduardo Arriols",
                "date": "4, 5 y 6 Marzo",
                "labels": [
                        "1250€",
                        "es"
                ],
                "links": [
                        "/docs/trainings/rooted2024-r24bcmad01-redteam.pdf",
                        "https://reg.rootedcon.com/payment/activity/165"
                ],
                "hours": "Horas del Bootcamp cada jornada: 09:00h - 20:00h",
                "description": "El objetivo del Bootcamp es dotar a los asistentes de capacidades para desarrollar ejercicios de intrusión y simulaciones reales de ataque, entendiendo el proceso, fases y acciones, así como las técnicas, herramientas y pautas para tener éxito en cualquier ejercicio independientemente de la organización objetivo. Durante el transcurso de la formación, de 3 días de duración, los alumnos trabajaran todos los aspectos de una intrusión, desde el despliegue de la infraestructura necesaria y el reconocimiento de activos hasta acciones internas como el movimiento lateral entre sistemas, compromiso de la infraestructura y el despliegue de una completa red de persistencias internas. El bootcamp tiene un claro objetivo de mostrar de forma práctica una metodología y técnicas útiles para desarrollar ataques dirigidos, motivo por el cual no se profundizará en técnicas que se salgan de ello. Se proporcionará a los alumnos un laboratorio tanto en local como en Cloud sobre el que simular todas las técnicas aprendidas."
        },
        {
                "id": "training-R24BCMAD02",
                "title": "[R24BCMAD02] Hardware Hacking + Soldering Skills + Firmware Reversing with Ghidra + SDR Radio",
                "people": "David Reguera & David Melendez & Gonzalo Carracedo & Antonio Vazquez & Cristina Casas Sastre",
                "date": "4, 5 y 6 Marzo",
                "labels": [
                        "1750€",
                        "es"
                ],
                "links": [
                        "/docs/trainings/rooted2024-r24bcmad02-exthacking.pdf",
                        "https://reg.rootedcon.com/payment/activity/168"
                ],
                "hours": "Horas del Bootcamp cada jornada: 09:00h - 20:00h",
                "description": "Curso para gente sin conocimiento de: IOT, de/soldar, hardware hacking, radio, reversing, electrónica y matemáticas.¿Tienes un cacharro IOT y quieres intentar extraer su firmware de un chip?¿Auditar IOT? ¿Quieres intentar modificar/reparar/reemplazar el chip BIOS de un portátil? ¿Quieres obtener habilidades de soldar+desoldar? TE DAMOS TODAS LAS HERRAMIENTAS ¿Quieres intentar hacer un MOD a tu router, consola, impresora 3D,patinete…? ¿Aprender lo básico de electrónica para no prender fuego a la casa todo el rato? ¿Cómo usar bus pirate v3 y otras herramientas para hardware hacking / IOT?  ¿Qué es JTAG, UART, I2C, SPI…? ¿I2C EEPROM vs SPI FLASH? ¿3,3v? ¿5v? ¿Satélites? SDR + microondas + sondas de la NASA ¿Reversing de firmware + ASM básico con GHIDRA?"
        },
        {
                "id": "training-R24BCMAD03",
                "title": "[R24BCMAD03] Respuesta ante incidentes en Windows y O365",
                "people": "Antonio Sanz",
                "date": "4, 5 y 6 Marzo",
                "labels": [
                        "1250€",
                        "es"
                ],
                "links": [
                        "/docs/trainings/rooted2024-r24bcmad03-incresponse.pdf",
                        "https://reg.rootedcon.com/payment/activity/171"
                ],
                "hours": "Horas del Bootcamp cada jornada: 09:00h - 20:00h",
                "description": "Ransomware. Estafas al CEO. Robo de datos por empleados descontentos. Ciberespionaje (industrial o de otros estados nación). El mundo actual depende totalmente de la tecnología, y los cibercriminales lo saben muy bien. Ante el aumento de los incidentes, la necesidad de tener personal técnico preparado para responder de manera rápida y eficiente es cada vez más importante.El objetivo de la formación es dotar a los asistentes de procedimientos, estrategias y herramientas para que sean capaces de responder ante un incidente de seguridad de forma solvente.Con un carácter eminentemente práctico, se plantearán las fases de la respuesta ante incidentes, indicando en cada caso las mejores herramientas disponibles y la mejor forma de sacarles el máximo partido, así como los quick wins que permiten encontrar la actividad maliciosa lo antes posible.El curso tendrá una componente forense fuerte, pero con la orientación propia de la respuesta ante incidentes, ofreciendo una simulación de incidente, 15 ejercicios prácticos y dos CTF (uno de Windows y otro de O365)"
        },
        {
                "id": "training-R24BCMAD04",
                "title": "[R24BCMAD04] Advanced Threat Hunting",
                "people": "Roberto Amado & Jose Miguel Holguín",
                "date": "4, 5 y 6 Marzo",
                "labels": [
                        "1250€",
                        "es"
                ],
                "links": [
                        "/docs/trainings/rooted2024-r24bcmad04-advthreathunting.pdf",
                        "https://reg.rootedcon.com/payment/activity/167"
                ],
                "hours": "Horas del Bootcamp cada jornada: 09:00h - 20:00h",
                "description": "Este Bootcamp pretende enseñar a los asistentes como \"cazar\" tanto malware genérico, como especímenes pertenecientes a grupos APT mediante una correcta instrumentación de diversas herramientas y la generación de una serie de “Hunts” capaces de identificar los más sofisticados ataques. La orientación totalmente práctica permitirá aprender no solo técnicas de intrusión sino los “Hunts” que permiten identificarlas. Estos se agruparán según la matriz de Mitre ATT&CK™ en : movimiento lateral, reconocimiento, persistencia, explotación, entre otros.El proceso de caza de malware se abordará desde dos perspectivas: por una parte el análisis del comportamiento de los procesos del sistema desde una perspectiva temporal (apoyándonos en la herramienta Sysmon) y por otra desde el punto de vista de la memoria RAM de los equipos, es decir se realizará un hunting de artefactos maliciosos basándonos en anomalías residentes en memoria.Complementando lo anterior se abordarán tanto nociones de análisis de malware básicas como de Threat Modeling, que permitirán a los asistentes afrontar de forma completa un proceso de Threat Hunting orientado al endpoint y a entornos servidor de tecnologías Microsoft Windows.Por último los alumnos afrontarán el reto de poder detectar actividades maliciosas de actores avanzados que hagan uso de ciberarmas como Cobalt Strike inmersos en un juego de RED vs BLUE team."
        },
        {
                "id": "training-R24BCMAD05",
                "title": "[R24BCMAD05] Cloud Pentesting (AWS, GCP, Azure)",
                "people": "Carlos Polop & Pau Borda",
                "date": "4, 5 y 6 Marzo",
                "labels": [
                        "1250€",
                        "es"
                ],
                "links": [
                        "/docs/trainings/rooted2024-r24bcmad05-cloudpentesting.pdf",
                        "https://reg.rootedcon.com/payment/activity/166"
                ],
                "hours": "Horas del Bootcamp cada jornada: 09:00h - 20:00h",
                "description": "La formación dura 3 días y se dedicará cada día a cada uno de los cloud más grandes: AWS, GCP & Azure. Se partirá de cero en cada cloud, enseñando los principios básicos de cada uno.Se enseñará cómo realizar pentest whitebox en cada cloud, desde qué permisos son necesarios, hasta qué acciones realizar para encontrar vulnerabilidades y malas configuracionesSe enseñará también, en cada cloud, cómo realizar pentest blackbox en cada cloud: Enumeración sin autenticar, puntos de entrada, explotación…Se afianzarán conceptos con la realización de juegos estilo CTF en los que comprometeremos entornos ficticios y escalaremos privilegios.Finalmente, se darán indicaciones a los asistentes de cómo continuar su formación después de estas jornadas."
        },
        {
                "id": "training-R24BCMAD06",
                "title": "[R24BCMAD06] Hacking Ético de Aplicaciones Móviles (Android / iOS)",
                "people": "Carlos Alberca & Daniel González",
                "date": "4, 5 y 6 Marzo",
                "labels": [
                        "1250€",
                        "es"
                ],
                "links": [
                        "/docs/trainings/rooted2024-r24bcmad06-ethicalhackingmov.pdf",
                        "https://reg.rootedcon.com/payment/activity/164"
                ],
                "hours": "Horas del Bootcamp cada jornada: 09:00h - 20:00h",
                "description": "¿Quieres descubrir las técnicas más avanzadas de hacking ético que te permitirán evaluar y fortalecer la seguridad de las aplicaciones móviles Android & iOS, abriendo así nuevas oportunidades profesionales en el emocionante campo de la ciberseguridad móvil? Si has respondido 'Si quiero', te invitamos a inscribirte en este Bootcamp, donde exploraremos las complejidades y desafíos de la seguridad en aplicaciones móviles, adquiriendo habilidades técnicas para identificar vulnerabilidades, evaluar riesgos y fortalecer la seguridad en el entorno móvil. La formación está orientada a la práctica del Test de Penetración (Penetration Testing) y Hacking Ético de aplicaciones móviles, con el objetivo de conocer, afianzar y practicar las bases de las diferentes técnicas de auditoría de aplicaciones móviles que existen, tanto para Android como iOS, así como llevar a cabo estos análisis haciendo uso de la archiconocida metodología OWASP Mobile Security Testing Guide (MSTG). Además, se darán pautas de cómo presentar los resultados obtenidos en un informe, si, esa parte tan crucial en el mundo profesional. ¡Sumérgete en la práctica (Hands-on Labs) analizando aplicaciones diseñadas específicamente para Android & iOS en un emocionante entorno virtual y emulado! ¡Ah!, y para poner a prueba tus conocimientos, al final del curso, te enfrentarás a un desafiante CTF donde el ganador/a se llevará ¡un dispositivo móvil como premio!"
        },
        {
                "id": "training-R24RLMAD01",
                "title": "[R24RLMAD01] Mi primera revisión de Directorio Activo desde el punto de vista ofensivo",
                "people": "Jorge Escabias",
                "date": "6 Marzo",
                "labels": [
                        "250€",
                        "es"
                ],
                "links": [
                        "/docs/trainings/rooted2024-r24rlmad01-ad.pdf",
                        "https://reg.rootedcon.com/payment/activity/169"
                ],
                "hours": "Horas del RootedLab: 09:00h - 20:00h",
                "description": "En esta formación, orientada a un primer contacto sobre entornos de Directorio Activo desde una perspectiva de un atacante, los asistentes podrán conocer todos los puntos necesarios para realizar una revisión de seguridad sobre este tipo de entornos. A lo largo del taller, los asistentes conocerán qué es y por qué elementos está formado un Directorio Activo, cómo enumerar estos entornos; conocerá las vulnerabilidades y fallos de configuración más comunes y sencillos que se pueden encontrar y entenderán los riesgos que pueden implicar en sus respectivas organizaciones. Además, dispondrán del conocimiento necesario para corregir (o mitigar) estas vulnerabilidades en entornos reales.Además, los asistentes también tendrán oportunidad de emplear herramientas legítimas ampliamente utilizadas por los auditores de seguridad para realizar reconocimiento, detectar y explotar las vulnerabilidades durante sus ejercicios de pentest.Por último, todos los asistentes podrán poner a prueba el conocimiento adquirido en un entorno controlado mediante la realización de determinados ejercicios siguiendo la modalidad CTF, ampliamente extendida en el sector de la ciberseguridad. Este entorno es propio y se divide en dos partes: una primera parte guiada con una serie de objetivos sencillos predefinidos y una segunda parte más libre orientada a la competición entre los participantes."
        },
        {
                "id": "training-R24RLMAD02",
                "title": "[R24RLMAD02] Frida & Mobile Pentesting",
                "people": "Pablo San Emeterio",
                "date": "4 Marzo",
                "labels": [
                        "250€",
                        "es"
                ],
                "links": [
                        "/docs/trainings/rooted2024-r24rlmad02-frida.pdf",
                        "https://reg.rootedcon.com/payment/activity/173"
                ],
                "hours": "Horas del RootedLab: 09:00h - 20:00h",
                "description": "El principal objetivo de este training es conocer las enormes posibilidades que ofrece Frida en el mundo de la ciberseguridad. La instrumentación dinámica de aplicaciones se utiliza tradicionalmente para analizar el rendimiento de aplicaciones o depurar programas, pero grandes aplicaciones, desde el punto de vista ofensivo como desde el punto de vista ofensivo. Frida se puede emplear como herramienta para llevar a cabo auditorias de aplicaciones móviles, como herramienta de análisis de código o como herramienta para corregir aplicaciones de las que no disponemos de su código."
        },
        {
                "id": "training-R24RLMAD03",
                "title": "[R24RLMAD03] Introducción al Hardware Hacking e IoT",
                "people": "David Meléndez",
                "date": "4 Marzo",
                "labels": [
                        "300€",
                        "es"
                ],
                "links": [
                        "/docs/trainings/rooted2024-r24rlmad03-hwiot.pdf",
                        "https://reg.rootedcon.com/payment/activity/170"
                ],
                "hours": "Horas del RootedLab: 09:00h - 20:00h",
                "description": "Descrubir el mundo del hardware de la mano de LinuxConocer los fundamentos de los sistemas IoT y embebidos. Diferencias entre Raspberry Pi, Arduino, routers, etc.Aprender a construir dispositivos con carácter ofensivo. ¿Cómo desarrollaron la WiFi Pineapple? Lo sabrás.Aprender a soldar.Aprender cómo funcionan termostatos, sensores, alarmas de seguridad, dispositivos médicos portátiles, pulseras de entrenamiento, etc"
        },
        {
                "id": "training-R24RLMAD04",
                "title": "[R24RLMAD04] Securizando tu desarrollo y entorno de 0 a 100%",
                "people": "Rafael Otal & Antonio José Juanilla",
                "date": "4 Marzo",
                "labels": [
                        "250€",
                        "es"
                ],
                "links": [
                        "/docs/trainings/rooted2024-r24rlmad04-hardening.pdf",
                        "https://reg.rootedcon.com/payment/activity/172"
                ],
                "hours": "Horas del RootedLab: 09:00h - 20:00h",
                "description": "En este training, nos sumergiremos profundamente en la cultura de SecDevOps, utilizando una variedad de herramientas Open Source como pilares fundamentales. A través del innovador framework OSDO (Open SecDevOps), proporcionaremos acceso a una extensa biblioteca de documentación actualizada y recursos prácticos. Este enfoque nos permite abarcar de manera integral el ciclo de vida de la seguridad en el desarrollo de software: desde la fase de programación inicial hasta el momento crítico del despliegue. Nuestro objetivo es equipar a los participantes con las habilidades, conocimientos y herramientas necesarias para implementar prácticas de seguridad efectivas en cada etapa del desarrollo, asegurando así aplicaciones más robustas y seguras. Prepárate para transformar tu manera de trabajar en el desarrollo de software con un enfoque sólido en la seguridad, adaptado a las exigencias del mercado actual."
        },
        {
                "id": "training-R24RLMAD05",
                "title": "[R24RLMAD05] Ethical Hacking: Training Metodología y entrenamiento resolviendo máquinas",
                "people": "Pablo González",
                "date": "5 Marzo",
                "labels": [
                        "250€",
                        "es"
                ],
                "links": [
                        "/docs/trainings/rooted2024-r24rlmad05-ethicalhacking.pdf",
                        "https://reg.rootedcon.com/payment/activity/174"
                ],
                "hours": "Horas del RootedLab: 09:00h - 20:00h",
                "description": "Hoy en día es necesario de un entrenamiento constante de los equipos de Red Team, Hacking Ético y/o Pentesting. Este entrenamiento se lleva a cabo a través del uso de escenarios preparados que permiten al pentester reciclarse en sus conocimientos. ¿Qué son los escenarios? Son un conjunto de máquinas virtuales y contenedores que muestran casos reales a los que un pentester se enfrenta. Este lab proporciona un aprendizaje de técnicas del día a día del pentester a través del uso de diferentes escenarios reales y clasificados por las diferentes técnicas y por nivel."
        },
        {
                "id": "training-R24RLMAD06",
                "title": "[R24RLMAD06] Pentesting a Smartcontracts & Web3",
                "people": "Pablo González",
                "date": "6 Marzo",
                "labels": [
                        "250€",
                        "es"
                ],
                "links": [
                        "/docs/trainings/rooted2024-r24rlmad06-web3.pdf",
                        "https://reg.rootedcon.com/payment/activity/175"
                ],
                "hours": "Horas del RootedLab: 09:00h - 20:00h",
                "description": "Aprender metodología para hacer un pentesting práctico y resolver problemasEntender el contexto de la web3 y de los SmartContractsConocer metodología para realizar pruebas de intrusión y análisis de seguridad en un proyecto web3Conocer vulnerabilidades que pueden afectar a un proyecto Web3 (en sus distintos ámbitos)Practicar sobre entornos de SmartContracts y detectar vulnerabilidadesAprender cómo llevar a cabo proyectos con SmartContracts mejorando su seguridad"
        }
]